{
    "displayName": "Python Preview",
    "description": "Provide Preview for Python Execution.",
    "pythonPreview.showPreview.title": "Open Preview",
    "pythonPreview.showPreviewToSide.title": "Open Preview to the Side",
    "pythonPreview.showLockedPreviewToSide.title": "Open Locked Preview to the Side",
    "pythonPreview.showSource.title": "Show Source",
    "pythonPreview.refresh.title": "Refresh Preview",
    "pythonPreview.toggleLock.title": "Toggle Preview Locking",
    "pythonPreview.disableHeapNesting.desc": "Set how heap objects should be rendered. \"true\" render all heap objects at the top level. Otherwise, nest heap objects.",
    "pythonPreview.textualMemoryLabels.desc": "Render refrences using textual memory labels rather than as jsPlumb arrows.",
    "pythonPreview.compactFuncLabels.desc": "Render functions with a 'func' prefix and not type label.",
    "pythonPreview.showAllFrameLabels.desc": "Display frame and parent frame labels for all functions.",
    "pythonPreview.hideCode.desc": "Hide the code display.",
    "pythonPreview.codAndNavWidth.desc": "Set code and navigation area width.",
    "pythonPreview.allowAllModules.desc": "Set whether all modules can be imported.",
    "pythonPreview.maxExecutedLines.desc": "Set the max number of executed lines, in order to against infinite loops.",
    "pythonPreview.cumulativeMode.desc": "Display all stack frames that have ever exited rather than only currently on the stack.",
    "pythonPreview.trace.desc": "Enable debug logging for the python-preview extension.",
    
    "pythonPreview.fontFamily.desc": "Control the font family used in the python preview.",
    "pythonPreview.fontSize.desc": "Control the font size in pixels used in the python preview.",
    "pythonPreview.langDisplay.fontFamily.desc": "Control the font family used in the lang display area.",
    "pythonPreview.langDisplay.fontSize.desc": "Control the font size in pixels used in the lang display area.",
    "pythonPreview.code.fontFamily.desc": "Control the font family used in the code display area.",
    "pythonPreview.code.fontSize.desc": "Control the font size in pixels in the code display area.",
    "pythonPreview.code.lineHeight.desc": "Control the line height used in the code.",
    "pythonPreview.legend.fontFamily.desc": "Control the font family used in the arrow legend.",
    "pythonPreview.legend.fontSize.desc": "Control the font size in pixels used in the arrow legend.",
    "pythonPreview.codeFooterDocs.fontFamily.desc": "Control the font family used in the code footer docs.",
    "pythonPreview.codeFooterDocs.fontSize.desc": "Control the font size in pixels used in the code footer docs.",
    "pythonPreview.printOutputDocs.fontFamily.desc": "Control the font family used int the print output docs.",
    "pythonPreview.printOutputDocs.fontSize.desc": "Control the font size in pixels in the print output docs.",
    "pythonPreview.pyStdout.fontSize.desc": "Control the font size in pixels used in the python stdout window.",
    "pythonPreview.pyStdout.fontFamily.desc": "Control the font family used in the python stdout window.",
    "pythonPreview.stackAndHeapHeader.fontFamily.desc": "Control the font family used in the stack header and heap header.",
    "pythonPreview.stackAndHeapHeader.fontSize.desc": "Control the font size in pixels used in the stack header and heap header.",
    "pythonPreview.stackFrame.fontFamily.desc": "Control the font family used in the stack frame.",
    "pythonPreview.stackFrame.fontSize.desc": "Control the font size in pixels used in the stack frame.",
    "pythonPreview.retVal.fontSize.desc": "Control the font size in pixels used in the function return value.",
    "pythonPreview.stackFrameHeader.fontFamily.desc": "Control the font family used in the stack frame header.",
    "pythonPreview.stackFrameHeader.fontSize.desc": "Control the font size in pixels used in the stack frame header.",
    "pythonPreview.heapObject.fontFamily.desc": "Control the font family used in the heap object.",
    "pythonPreview.heapObject.fontSize.desc": "Control the font size in pixels used in the heap object.",
    "pythonPreview.typeLabel.fontFamily.desc": "Control the font family used in the type label of heap object.",
    "pythonPreview.typeLabel.fontSize.desc": "Control the font size in pixels used in the type label of heap object.",

    "pythonPreview.light.highlightedArrow.color.desc": "Control the color used in highlighted arrow in vscode light theme.",
    "pythonPreview.light.highlightedStackFrame.bgColor.desc": "Control the background color used in highlighted stack frame in vscode light theme.",
    "pythonPreview.light.list-tuple-setTbl.bgColor.desc": "Control the background color used in list, tuple and set in vscode light theme.",
    "pythonPreview.light.dict-class-instKey.bgColor.desc": "Control the background color used in dict, class and instance key in vscode light theme.",
    "pythonPreview.light.dict-class-instVal.bgColor.desc": "Control the background color used in dict, class and instance value in vscode light theme.",
    "pythonPreview.dark.highlightedArrow.color.desc": "Control the color used in highlighted arrow in vscode dark theme.",
    "pythonPreview.dark.highlightedStackFrame.bgColor.desc": "Control the background color used in highlighted stack frame in vscode dark theme.",
    "pythonPreview.dark.list-tuple-setTbl.bgColor.desc": "Control the background color used in list, tuple and set in vscode dark theme.",
    "pythonPreview.dark.dict-class-instKey.bgColor.desc": "Control the background color used in dict, class and instance key in vscode dark theme.",
    "pythonPreview.dark.dict-class-instVal.bgColor.desc": "Control the background color used in dict, class and instance value in vscode dark theme.",
    "pythonPreview.high-contrast.highlightedArrow.color.desc": "Control the color used in highlighted stack frame in vscode high-contrast theme.",
    "pythonPreview.high-contrast.highlightedStackFrame.bgColor.desc": "Control the background color used in highlighted stack frame in vscode high-contrast theme.",
    "pythonPreview.high-contrast.list-tuple-setTbl.bgColor.desc": "Control the background color used in list, tuple and set in vscode high-contrast theme.",
    "pythonPreview.high-contrast.dict-class-instKey.bgColor.desc": "Control the background color used in dict, class and instance key in vscode high-contrast theme.",
    "pythonPreview.high-contrast.dict-class-instVal.bgColor.desc": "Control the background color used in dict, class and instance value in vscode high-contrast theme."
}